Tekla Open API Reference for Tekla Structures 2025
MainWindow.RemoveExternalWindow Method
 Removes a registration done with AddExternalWindow(String, IntPtr).
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RemoveExternalWindow(
	string Name,
	IntPtr Handle
)
Public Sub RemoveExternalWindow (
	Name As String,
	Handle As IntPtr
)
Parameters
Name
Type: System.String
The unique name of the form.
Handle
Type: System.IntPtr
The handle to the form that is to be removed.
See Also
Reference
MainWindow Class
Tekla.Structures.Dialog Namespace